In [12]:
import pandas as pd
import numpy as np

In [13]:
input = open('input_f1.txt').readlines()
input = [x.split() for x in input]
input.pop(0)
input

[['1', '1'], ['1', '2']]

In [14]:
df = pd.read_csv('titanic_new.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [19]:
def similarity(id1, id2):  
    result = 0
    passenger_a = df.loc[id1-1]
    passenger_b = df.loc[id2-1]  
    if passenger_a.Pclass == passenger_b.Pclass:  
        result += 1  
    if passenger_a.Sex == passenger_b.Sex:  
        result += 3  
    if passenger_a.SibSp == passenger_b.SibSp:  
        result += 1  
    if passenger_a.Parch == passenger_b.Parch:  
        result += 1  
    result += max(0, 2 - abs(passenger_a.Age - passenger_b.Age) / 10.0)  
    result += max(0, 2 - abs(passenger_a.Fare - passenger_b.Fare) / 5.0)  
    return result / 10.0

In [28]:
for x in input:
    id1 = int(x[0])
    id2 = int(x[1])
    print(round(similarity(id1, id2), 2))

1.0
0.24